# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [4]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [5]:
# Your code here
cur.execute('''SELECT * FROM employees;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 23

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056,Sale Manager (EMEA)

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [9]:
# Your code her
cur.execute('''SELECT contactLastName, contactFirstName,
                orderDate, orderNumber, status
                FROM customers 
                JOIN orders 
                USING(customerNumber)''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 326

  contactLastName contactFirstName   orderDate  orderNumber   status
0         Schmitt          Carine   2003-05-20        10123  Shipped
1         Schmitt          Carine   2004-09-27        10298  Shipped
2         Schmitt          Carine   2004-11-25        10345  Shipped
3            King             Jean  2003-05-21        10124  Shipped
4            King             Jean  2004-08-06        10278  Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [11]:
# Your code her
cur.execute('''SELECT contactLastName, contactFirstName,
                paymentDate, amount
                FROM customers 
                JOIN payments 
                USING(customerNumber)''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 273

  contactLastName contactFirstName paymentDate    amount
0         Schmitt          Carine   2003-06-05  14571.44
1         Schmitt          Carine   2004-10-19   6066.78
2         Schmitt          Carine   2004-12-18   1676.14
3            King             Jean  2003-06-06  32641.98
4            King             Jean  2004-08-20  33347.88

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [20]:

cur.execute('''SELECT contactLastName, contactFirstName, productName, quantityOrdered, orderDate
                FROM products
                JOIN orderdetails
                USING (productCode)
                JOIN orders
                USING (orderNumber)
                JOIN customers
                USING (customerNumber)
                ORDER BY orderDate DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 2996

,contactLastName,contactFirstName,productName,quantityOrdered,orderDate
0,Freyre,Diego,1952 Alpine Renault 1300,50,2005-05-31
1,Labrune,Janine,1962 LanciaA Delta 16V,38,2005-05-31
2,Freyre,Diego,1958 Setra Bus,49,2005-05-31
3,Labrune,Janine,1957 Chevy Pickup,33,2005-05-31
4,Freyre,Diego,1940 Ford Pickup Truck,54,2005-05-31

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!